app/controllers/articles_controller.rb

INSERT INTO "articles" ("name", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "andres"], ["phone", "3333"], ["email", "jasd@gmail.com"], ["created_at", 2016-09-21 21:57:45 UTC], ["updated_at", 2016-09-21 21:57:45 UTC]]
---
  def create
  	@article = Article.new(article_params)

  	if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "email" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["email", "balebell@gmail.com"], ["updated_at", 2016-09-22 20:30:35 UTC], ["id", 3]]
---
  def update
	  @article = Article.find(params[:id])

	  if @article.update(article_params)